# wc 테이블에서 데이터 조회
table wc

------------------------------------------------------------------

# 로그 내에 'remote_host' 문자열이 포함된 항목 필터링
| search remote_host
# remote_host 값별로 그룹화하여 각 그룹의 행 개수 집계
| stats count() by remote_host

------------------------------------------------------------------

# 대용량 테이블일 때, 기간 제한 또는 조건 추가로 범위 줄이기
table wc
| search _time >= '2025-07-01T00:00:00' and _time < '2025-07-02T00:00:00'
| stats count() by remote_host

------------------------------------------------------------------

# 조회 속도 기반
table wc
| stats count() by remote_host